{
    "data": {
        "personalData": {
            "location": "Alcobendas, 28100",
            "email": "16ahmm@gmail.com",
            "name": "Alex Hernández",
            "roll": "Desarrollador Web",
            "socialNetworks": {
                "name": "LinkedIn",
                "url": "http://linkedin.com/in/alex-hernández-m"
            }
        },
        "courses": [
            {
                "show": true,
                "date": 2018,
                "title": "Curso profesional de Git y GitHub."
            },
            {
                "show": false,
                "date": 2018,
                "title": "Curso básico de Vue.js."
            },
            {
                "show": false,
                "date": 2018,
                "title": "Curso básico de React.js."
            },
            {
                "show": true,
                "date": 2019,
                "title": "Curso profesional de React.js."
            },
            {
                "show": false,
                "date": 2019,
                "title": "Curso básico de Node.js."
            },
            {
                "show": true,
                "date": 2020,
                "title": "Curso básico React Native.js."
            },
            {
                "show": false,
                "date": 2020,
                "title": "Curso básico Cypress.js."
            },
            {
                "show": true,
                "date": 2021,
                "title": "Curso básico DevOps - GitLab."
            }
        ],
        "skills": {
            "series": [
                {
                    "data": [
                        {
                            "x": "React",
                            "y": 100
                        },
                        {
                            "x": "JavaScript",
                            "y": 100
                        },
                        {
                            "x": "HTML5",
                            "y": 100
                        },
                        {
                            "x": "CSS3/SASS",
                            "y": 100
                        },
                        {
                            "x": "Gitlab",
                            "y": 100
                        },
                        {
                            "x": "Node",
                            "y": 70
                        },
                        {
                            "x": "Vue",
                            "y": 50
                        },
                        {
                            "x": "React Native",
                            "y": 50
                        },
                        {
                            "x": "Express",
                            "y": 70
                        },
                        {
                            "x": "MongoDB",
                            "y": 60
                        },
                        {
                            "x": "Moongose",
                            "y": 60
                        },
                        {
                            "x": "Redux",
                            "y": 50
                        },
                        {
                            "x": "GraphQL",
                            "y": 15
                        },
                        {
                            "x": "MySQL",
                            "y": 15
                        }
                    ]
                }
            ],
            "options": {
                "colors": [
                    "#00bbff"
                ],
                "legend": {
                    "show": false
                },
                "chart": {
                    "height": 370,
                    "type": "treemap"
                }
            }
        },
        "studies": [
            {
                "date": "2013 - 2015",
                "name": "U.P.M.",
                "title": "Ing. Alimentaria. Madrid, España.",
                "location": "Madrid, España."
            },
            {
                "date": "2015 - 2017",
                "name": "I.E.S El Lago.",
                "title": "Grado Superior D.A.W.M.I.",
                "location": "Madrid, España."
            }
        ],
        "experience": [
            {
                "companyName": "Sngular (actualmente)",
                "url": "https://www.sngular.com/es/",
                "roll": "Desarrollador FrontEnd",
                "dateRange": "Feb 2020 – actualidad.",
                "projects": [
                    {
                        "name": "Formación/Proyecto interno Sngular",
                        "resume": "Creación de un sistema de Diseño basado en Tokens, WebComponents con Polymer y Lit Elements."
                    },
                    {
                        "name": "Colaboración con Cabify",
                        "resume": "Esta colaboración consistió en el desarrollo e  implementación de una nueva interfaz en el proceso de onboarding de cada posible conductor de Cabify. <br /> Anteriormente, Cabify utilizaba una herramienta llamada Fountain, esta herramienta fue sustituida por una nueva aplicación mucho más amigable, usable, intuitiva y adaptable para cada proceso de onboarding de los diferentes países en los que actúa Cabify.  <br /><br /> La <b>parte Front</b> de este proyecto se realizó mediante el <u>Framework React.js</u> debido a que es una tecnología con la que Cabify trabaja habitualmente. Utilizado en su última versión y haciendo uso de sus últimas actualizaciones, para el manejo del estado de la aplicación globalmente se hizo uso de <b>React.createContext</b>. A parte, el manejo de errores se controló mediante una integración con la herramienta <u>Rollbar</u> que permite trazar todas las interacciones y errores que se producen en la aplicación. Además, esta aplicación necesitaba estar conectada con los siguientes servicios: <u>Google Tag Manager</u> y <u>Amplitude</u> para el tracking continuo y las conversiones que los diferentes departamentos de Cabify querían realizar sobre la aplicación.  <br /><br />La <b>parte Back</b> de esta aplicación se realizó en <u>Node.js</u> junto con <u>Express.js</u>. La función principal de este BackEnd es la de interactuar con la herramienta Fountain que es la que nos provee todos los datos que necesitamos recolectar de cada usuario de la Aplicación. A parte, con esta nueva interfaz se consigue que la herramienta Fountain tenga sólo la función de almacenamiento y no la de interfaz que era poco amigable y usable para los usuarios."
                    }
                ],
                "skills": {
                    "title": "Trabajo diariamente con las siguientes tecnologías:",
                    "bullets": [
                        "JavaScript",
                        "React",
                        "Redux",
                        "HTML5",
                        "CSS3",
                        "SASS",
                        "Node",
                        "Express",
                        "Cypress",
                        "Git",
                        "GitLab",
                        "Rollbar",
                        "Amplitude"
                    ]
                }
            },
            {
                "companyName": "Digi Mobil",
                "url": "https://www.digimobil.es/",
                "roll": "Desarrollador Web",
                "dateRange": "Ene 2019  – Ene 2020.",
                "projects": [
                    {
                        "name": "MiCuentaDigi (1 año)",
                        "resume": "Mis funciones fueron las de desarrollar, mejorar y mantener una aplicación web en la que puedes consultar tus datos personales, facturas, saldo, realizar cambios de productos y muchas más funciones dentro de la aplicación. Para entender mejor el contexto, Digi mobil es una operadora telefónica y con esta aplicación se consiguió una mejor manera de que los clientes pudieran consultar sus líneas telefónicas."
                    }
                ],
                "skills": {
                    "title": "Trabajé diariamente con las siguientes tecnologías:",
                    "bullets": [
                        "JavaScript",
                        "React",
                        "Redux",
                        "HTML5",
                        "CSS3",
                        "SASS",
                        "PHP(Zend framework 3)",
                        "GraphQL",
                        "MySQL",
                        "MongoDB",
                        "Cypress",
                        "Git",
                        "GitLab"
                    ]
                }
            },
            {
                "companyName": "Bookassist",
                "url": "https://bookassist.org/es",
                "roll": "Desarrollador Web",
                "dateRange": "Apr 2017 - Ene 2019.",
                "dailyFunctions": "Mis funciones fueron diseñar, maquetar, mantener y desarrollar páginas webs para hoteles, el desarrollo de un CMS y la mejora de un portfolio existente.",
                "projects": [
                    {
                        "name": "CMS (6 meses)",
                        "resume": "Gracias a la implementación de este CMS, el cliente hotelero tenía a su disposición la posibilidad de modificar el contenido (datos propios del hotel, imágenes de habitaciones, logos, etc) de su página web."
                    },
                    {
                        "name": "Rediseño Portfolio (1 mes)",
                        "resume": "El principal objetivo de este proyecto era la mejora y rediseño del portfolio existente. Con este nuevo portfolio conseguimos mostrar de una forma más usable e intuitiva nuestros templates al cliente."
                    },
                    {
                        "name": "Mejoras en nuestros templates (trabajo diario y continuo)",
                        "resume": "Trabajábamos con 8 templates para que los clientes pudieran elegir distintos diseños para sus páginas webs. Estos templates a medida que pasaba el tiempo requerían nuevas actualizaciones tanto en diseño como en programación."
                    }
                ],
                "skills": {
                    "title": "Trabajé diariamente con las siguientes tecnologías:",
                    "bullets": [
                        "JavaScript",
                        "JQuery",
                        "HTML5",
                        "CSS3",
                        "SASS",
                        "PHP7",
                        "Git",
                        "Adobe Photoshop",
                        "Adobe Illustrator"
                    ]
                }
            },
            {
                "companyName": "Tandem Publicidad",
                "url": "#",
                "roll": "Diseñador y Desarrollador Web",
                "dateRange": "Jun 2016 - Apr 2017.",
                "dailyFunctions": "Cumplí las funciones de diseñar y mantener páginas Web en WordPress. A parte, colabaraba en la creeación de diseños mientras aprendía mis primeros conceptos sobre Adobe Photoshop y Adobe Illustrator",
                "skills": {
                    "title": "Trabajé diariamente con las siguientes tecnologías:",
                    "bullets": [
                        "WordPress",
                        "JavaScript",
                        "HTML5",
                        "CSS3",
                        "Php",
                        "Adobe Photoshop",
                        "Adobe Illustrator"
                    ]
                },
                "projects": [
                    {
                        "name": "Mejoras Webs (trabajo diario y continuo)",
                        "resume": "Trabajábamos continuamente en mejoras en nuestra web."
                    },
                    {
                        "name": "Diseños de tarjetas de presentación, creación de logos y otros tipos de diseños",
                        "resume": "La empresa tenía otra vertiente económica en la que se dedicaba de lleno a la creación de diferentes diseños que los clientes solicitaban."
                    }
                ]
            }
        ],
        "collaboration": [
            {
                "name": "RemittVen",
                "link": "https://remittven.co.uk/",
                "resume": [
                    "Creación de la <a href='https://remittven.co.uk/' title='link-remittven' target='_blank'>página web</a> de la empresa RemittVen.",
                    "Creación de la <a href='https://remittven.co.uk/AreaCliente' title='link-remittven/AreaCliente' target='_blank'> aplicación web </a> con la que los usuarios pueden consultar sus servicios, transacciones, beneficiarios y más detalles. <br />También pueden hacer transferencias dentro de la aplicación gracias a una integración con una plataforma de pago llamada Checkout."
                ],
                "avatar": "https://remittven.co.uk/images/favicon.png",
                "description": "Remittven es una empresa británica. Cumple plenamente con todos los estándares exigidos por una capital financiera como Londres.",
                "reviews": [
                    "Seguro y confiable. Lo recomiendo sin reparos",
                    "Nunca había utilizado un servicio así. Super fácil. Toda la información está en la página web, te registras, registras la cuenta venezolana y luego es super sencillo el procedimiento. En horas tenía el dinero en S! Super recomendado!"
                ],
                "skills": [
                    "JavaScript",
                    "React",
                    "Redux",
                    "HTML5",
                    "CSS3",
                    "SASS",
                    "Cypress"
                ]
            }
        ],
        "blog": [
            {
                "title": "\"Conoce cómo\" estructuro mis proyectos FrontEnd.",
                "date": "09/03/2021",
                "content": [
                    {
                        "paragraph": "En el siguienete apartado vamos a tratar como organizo mis proyectos FrontEnd. En este caso vamos a analizar en concreto un proyecto realizado con React utilizando la api de createContext()."
                    },
                    {
                        "paragraph": "Partimos de la estructura básica que <code>npx create-react-app</code> nos provee (mirar el árbol de la derecha). En la carpeta src/ encontraremos el grosor de nuestra aplicación."
                    },
                    {
                        "paragraph": "Empezaremos con la carpeta src/assets/. En esta situaremos todos nuestros recursos a utilizar en la aplicación, tales como: imágenes, una carpeta para las hojas de estilo, fuentes y demás recursos que podamos necesitar. "
                    },
                    {
                        "paragraph": "Continuamos con la carpeta src/components/ en la que situaremos todos nuestros componentes React. Explicar {Layout, Commons, Forms.}"
                    },
                    {
                        "paragraph": "Dependiendo del tamaño de datos que vamos manipular dentro de nuestra App, crearemos una carpeta llamada context, en la que si el volumen de datos que vamos a utilizar no es excesivamente grande, crearemos nuestros contextos mediante React.createContext(). Si el volumen de datos es excesivamente grande haremos uso de Redux para manipular los datos y el estado de nustra aplicación. Esta implementación con Redux la veremos en otro <b>\"Conoce cómo\"</b>."
                    },
                    {
                        "paragraph": "En la carpeta src/services/ incluiremos diferentes servicios que consumimos en nuestra aplicación. Por ejemplo, la api que vayamos a consumir para nuestra Aplicación, en una de mis últimas colaboraciones situé en esta carpeta una integración con Rollbar que es un sistema que ayudar al seguimiento de errores de la aplicación. A parte, cuando he trabajado con integraciones como Amplitude o Google Analytics, también las he situado en esta carpeta."
                    }
                ],
                "tree": [
                    {
                        "title": "example-project",
                        "key": "0-0",
                        "children": [
                            {
                                "title": "public",
                                "key": "0-0-0",
                                "children": [
                                    {
                                        "title": "index.html",
                                        "key": "0-0-0-0"
                                    }
                                ]
                            },
                            {
                                "title": "src",
                                "key": "0-0-1",
                                "children": [
                                    {
                                        "title": "assets",
                                        "key": "0-0-1-0",
                                        "children": [
                                            {
                                                "title": "images",
                                                "key": "0-0-1-0-0"
                                            },
                                            {
                                                "title": "fonts",
                                                "key": "0-0-1-0-1"
                                            },
                                            {
                                                "title": "scss",
                                                "key": "0-0-1-0-2"
                                            }
                                        ]
                                    },
                                    {
                                        "title": "components",
                                        "key": "0-0-1-1",
                                        "children": [
                                            {
                                                "title": "Layout",
                                                "key": "0-0-1-1-0",
                                                "children": [
                                                    {
                                                        "title": "Header, Menu, Footer...",
                                                        "key": "0-0-1-1-0-0"
                                                    }
                                                ]
                                            },
                                            {
                                                "title": "Commons",
                                                "key": "0-0-1-1-1",
                                                "children": [
                                                    {
                                                        "title": "Modal, Tabs, Card...",
                                                        "key": "0-0-1-1-1-0"
                                                    }
                                                ]
                                            },
                                            {
                                                "title": "Forms",
                                                "key": "0-0-1-1-2",
                                                "children": [
                                                    {
                                                        "title": "Contact, Login, Register...",
                                                        "key": "0-0-1-1-2-0"
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "title": "context",
                                        "key": "0-0-1-2",
                                        "children": [
                                            {
                                                "title": "{entity}.context.js",
                                                "key": "0-0-1-2-0"
                                            }
                                        ]
                                    },
                                    {
                                        "title": "services",
                                        "key": "0-0-1-3",
                                        "children": [
                                            {
                                                "title": "api",
                                                "key": "0-0-1-3-0"
                                            },
                                            {
                                                "title": "rollbar",
                                                "key": "0-0-1-3-1"
                                            },
                                            {
                                                "title": "events",
                                                "key": "0-0-1-3-2"
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "title": ".env",
                                "key": "0-0-2"
                            },
                            {
                                "title": "package-lock.json",
                                "key": "0-0-3"
                            },
                            {
                                "title": "package.json",
                                "key": "0-0-4"
                            }
                        ]
                    }
                ]
            },
            {
                "title": "\"Conoce cómo\" trabajo con SASS.",
                "date": "09/03/2021",
                "content": [
                    {
                        "paragraph": "Próximamente..."
                    },
                    {
                        "paragraph": ""
                    },
                    {
                        "paragraph": ""
                    }
                ]
            },
            {
                "title": "\"Conoce cómo\" trabajo con Redux.",
                "date": "09/03/2021",
                "content": [
                    {
                        "paragraph": "Próximamente..."
                    },
                    {
                        "paragraph": ""
                    },
                    {
                        "paragraph": ""
                    }
                ]
            },
            {
                "title": "\"Conoce cómo\" estructuro mis proyectos BackEnd.",
                "date": "09/03/2021",
                "content": [
                    {
                        "paragraph": "Próximamente..."
                    },
                    {
                        "paragraph": ""
                    },
                    {
                        "paragraph": ""
                    }
                ]
            }
        ]
    }
}